### QUIZ

Q-1)Which value will the PERCENT_RANK() function never return?
A-1)1.5-->PERCENT_RANK returns a percentage value that will always be between 0 and 1.

Q-2-->Which of these best describes the output of the cumulative distribution function CUME_DIST()?
A-2->the row's sorted position, divided by the number of rows in the data set


Q-3->Which of these is NOT true about the PostgreSQL ranking functions?


X RANK() may skip values in the results.

X DENSE_RANK() will not skip values in the results.

X RANK() will assign the same rank to rows with the same input value.

âˆš DENSE_RANK() will assign different ranks to rows with the same input value.
Both RANK() and DENSE_RANK() will return the same rank given the same input values.


Q-4-->Given the data set 'my_numbers' with the values 10, 20, 30, 40, 50, what would be the result of this function? select rank (28) within group (order by my_numbers desc) from dataset

A-4-->50,40,30,(28)-4,20,10

In [1]:
from sqlalchemy import create_engine
import pandas as pd
# connection string: driver://username:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:password@localhost/two_three')

In [3]:
pd.read_sql_query('select * from public.people_heights', engine).head(3)

   person_id    name  height_inches gender
0          1  Sophia          65.50      f
1          2   Kelly          64.30      m
2          3     Dee          73.75      m

In [7]:
#RankRow with window Function
#dense_rank:uniqeu rank measurement such as same thing 12,12 order
#Rank:
pd.read_sql_query(
        '''
-- ranking with window functions
select name,
    height_inches,
    gender,
    rank() over (partition by gender order by height_inches desc),
    dense_rank() over (partition by gender order by height_inches desc)


from public.people_heights
order by gender, height_inches desc;

        ''', engine).head(10)

       name  height_inches gender  rank  dense_rank
0     Kasha          73.83      f     1           1
1    Lucina          71.71      f     2           2
2       Ria          70.56      f     3           3
3  Machelle          70.37      f     4           4
4    Pamula          69.57      f     5           5
5  Marcelle          68.85      f     6           6
6     Keren          68.78      f     7           7
7     Clare          68.77      f     8           8
8      Dora          68.76      f     9           9
9   Annette          68.43      f    10          10

In [10]:
#FIND hypothetical rank :show the new record position in rank

#example--> rank(70) will rank f 5 and m 83 , non 87
pd.read_sql_query(
        '''
-- using rank as a hypothetical grouping set aggregate

select name, height_inches
from public.people_heights
order by height_inches desc;

select gender,
rank(70) within group (order by height_inches desc)
from public.people_heights
group by rollup (gender);
        
        
        ''', engine).head(10)

  gender  rank
0      f     5
1      m    83
2   None    87

In [13]:
##View Top performance with percentile RANKS
#Example--> only 0.002506 percentage rows above Steph
#CASE WHEN--> If else loop logic
pd.read_sql_query(
    """
    select name, gender, height_inches,
	percent_rank() over (order by height_inches desc),
	case
		when percent_rank() over (order by height_inches desc) < .25 then '1st'
		when percent_rank() over (order by height_inches desc) < .50 then '2nd'
		when percent_rank() over (order by height_inches desc) < .75 then '3rd'
		else '4th'
	end as "quartile rank"
from public.people_heights
order by height_inches desc;
    
    """, engine).head(10)

        name gender  height_inches  percent_rank quartile rank
0  Marcellus      m          76.87      0.000000           1st
1      Steph      m          74.74      0.002506           1st
2     Joesph      m          74.71      0.005013           1st
3      Jorge      m          74.61      0.007519           1st
4    Shelton      m          74.32      0.010025           1st
5    Derrick      m          74.17      0.012531           1st
6      Rufus      m          74.09      0.015038           1st
7         Bo      m          74.00      0.017544           1st
8      Kasha      f          73.83      0.020050           1st
9        Dee      m          73.75      0.022556           1st

In [14]:
#RANK-cumulative distribution
#cume_dist()
#400 rows in table 2/400=0.0050 Steph

#but percentage_rank 1/399 = 0.002506 #not included itself
pd.read_sql_query(
    """
select name, gender, height_inches,
    percent_rank() over (order by height_inches desc),
    cume_dist() over (order by height_inches desc)
from public.people_heights
order by height_inches desc;
    
    """, engine).head(10)

        name gender  height_inches  percent_rank  cume_dist
0  Marcellus      m          76.87      0.000000     0.0025
1      Steph      m          74.74      0.002506     0.0050
2     Joesph      m          74.71      0.005013     0.0075
3      Jorge      m          74.61      0.007519     0.0100
4    Shelton      m          74.32      0.010025     0.0125
5    Derrick      m          74.17      0.012531     0.0150
6      Rufus      m          74.09      0.015038     0.0175
7         Bo      m          74.00      0.017544     0.0200
8      Kasha      f          73.83      0.020050     0.0225
9        Dee      m          73.75      0.022556     0.0250

### Challenge

*Use inventory.product to rank product pricing*

*Display ranking overall,segmented by category and by size*

In [15]:
pd.read_sql_query('select * from inventory.products', engine).head(3)

      sku product_name  category_id  size  price
0  ALB008     Delicate            1     8  10.99
1  ALB032     Delicate            1    32  18.99
2  ALB064     Delicate            1    64  22.99

In [34]:
pd.read_sql_query(
    """
-- rank product pricing overall, by category, and by size

select product_name, category_id, size, price,
	dense_rank() over (order by price desc) as "rank overall",
	dense_rank() over (partition by category_id order by price desc) as "rank category",
	dense_rank() over (partition by size order by price desc) as "rank price"
from inventory.products
order by category_id, price desc
    ;
    """, engine).head(10)

,product_name,category_id,size,price,rank overall,rank category,rank price
0,Bold,1,128,27.99,1,1,1
1,Picholine,1,128,27.99,1,1,1
2,Oblica,1,128,27.99,1,1,1
3,Mission,1,128,26.99,2,2,2
4,Moraiolo,1,128,26.99,2,2,2
5,Leccino,1,128,26.99,2,2,2
6,Picual,1,128,26.99,2,2,2
7,Pendolino,1,128,26.99,2,2,2
8,Koroneiki,1,128,26.99,2,2,2
9,Manzanilla,1,128,26.99,2,2,2